package com.test.java;

public class Ex09_Error {

	public static void main(String[] args) {
		
		int a = 10;
		
		System.out.println(100 / a);
		
		/*
		 에러- Error
		 - 오류, 버그(Bug), 예외(Exception) 등 ...
		 
		 1. 컴파일 에러
		 	컴파일 작업중에 발생하는 에러
		 	컴파일러 !! -> 번역중 ... -> 문법이 틀려서 발생 -> 
		 		컴파일 작업 중단 -> 프로그램 생성 불가 -> 반드시 해결해야 한다(100%)
		 		--> 난이도는 가장 낮다 -> 컴파일러가 알려줌 -> 에러메세지!!(대부분 오타, 빨간 밑줄)
		 
		 2. 런타임 에러
		 	런타임(Runtime) -> 실행중
		 	컴파일 작업중에는 없었는데.. 실행중에 발생하는 에러
		 	문법에는 오류가 없음 -> 하지만 다른원인으로 발생하는 에러
		 	예외(Exception)
		 	난이도 중간 -> 발견 O, X(복불복)
		 
		 3. 논리 에러
		 	컴파일 성공!! + 실행 성공!! -> 결과가 이상;;
		 	
		 
		 
		 */
		
		
		
		
	}

}
